In [1]:
import os

In [2]:
#!pip install mysql-connector

In [3]:
#!pip uninstall mysql-connector

In [4]:
#!pip install mysql-connector-python

In [5]:
import mysql.connector

In [6]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [7]:
user_name=os.environ.get('DB_USER')
password=os.environ.get('DB_PASS')

In [8]:
connection=mysql.connector.connect(host='localhost', user="root",password="harinhk",database='imdb',auth_plugin='mysql_native_password')

In [23]:
connection

In [ ]:
#DML means data manipulation language #insert, update and delete are DML commands

In [24]:
pd.read_sql_query("USE db1", connection)

TypeError: 'NoneType' object is not iterable

In [25]:
pd.read_sql_query("SHOW TABLES FROM db1", connection)

    Tables_in_db1
0  employee table

In [27]:
pd.read_sql_query("SELECT * FROM `employee table`", connection)

   Employee id Employee firstname Employee lastname  Age Department
0          125               nhk2              nhk3   26

In [29]:
pd.read_sql_query("INSERT INTO `employee table`(`Employee id`, `Employee firstname`, `Employee lastname`, Age, Department) values(126, 'nhk4', 'nhk5', 27, 'ML')", connection)

DatabaseError: Execution failed on sql 'INSERT INTO `employee table`(`Employee id`, `Employee firstname`, `Employee lastname`, Age, Department) values(126, 'nhk4', 'nhk5', 27, 'ML')': 1062 (23000): Duplicate entry '126' for key 'PRIMARY'

In [30]:
pd.read_sql_query("USE imdb", connection)

TypeError: 'NoneType' object is not iterable

In [32]:
pd.read_sql_query("SHOW TABLES FROM imdb", connection)

     Tables_in_imdb
0            actors
1         directors
2  directors_genres
3        helloworld
4            movies
5  movies_directors
6     movies_genres
7             roles

In [31]:
pd.read_sql_query("SELECT * FROM actors", connection)

            id     first_name           last_name gender
0            2        Michael  'babeepower' Viera      M
1            3           Eloy         'Chincheta'      M
2            4       Dieguito         'El Cigala'      M
3            5        Antonio    'El de Chipiona'      M
4            6           José        'El Francés'      M
...        ...            ...                 ...    ...
817713  845461         Herdís      Þorvaldsdóttir      F
817714  845462  Katla Margrét      Þorvaldsdóttir      F
817715  845463     Lilja Nótt      Þórarinsdóttir      F
817716  845464     Hólmfríður      Þórhallsdóttir      F
817717  845465       Theódóra        Þórðardóttir      F

[817718 rows x 4 columns]

In [ ]:
#DDL commands
#Create, alter, drop, truncate ,rename, truncate, rename

In [33]:
pd.read_sql_query("CREATE TABLE student(sno int, sname varchar(20), age int, dob date)", connection)

TypeError: 'NoneType' object is not iterable

In [36]:
pd.read_sql_query("SHOW TABLES FROM imdb", connection)

     Tables_in_imdb
0            actors
1         directors
2  directors_genres
3        helloworld
4            movies
5  movies_directors
6     movies_genres
7             roles
8           student

In [38]:
pd.read_sql_query("SELECT * FROM student", connection)

Empty DataFrame
Columns: [sno, sname, age, dob]
Index: []